# PrevObj

## Description
Function PrevObj returns the object in any list which precedes the specified object.  If the end of the list is reached, the function returns NIL. &lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION PrevObj(h : HANDLE) : HANDLE;
```

```python

def vs.PrevObj(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object,  group, or  symbol definition.|

## Version
Availability: from MiniCAD
## Category
* Document List Handling